000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID. ROLS6023.
000300 ENVIRONMENT DIVISION.
000400 INPUT-OUTPUT SECTION.
000500 FILE-CONTROL.
000600     SELECT PRODUCT-FILE ASSIGN TO PRODUCTS
000700       ORGANIZATION IS SEQUENTIAL.
000800 DATA DIVISION.
000900 FILE SECTION.
001000 FD PRODUCT-FILE.
001100 01 PRODUCT-FILE-REC.
001200    05 F-PRD-ID PIC 9(6).
001300    05 F-PRD-NAME PIC X(30).
001400    05 F-PRD-PRICE PIC 9(7)V99.
001500    05 F-PRD-STOCK PIC 9(7).
001600 WORKING-STORAGE SECTION.
001700 01 WS-EOF PIC X VALUE SPACE.
001800 PROCEDURE DIVISION.
001900 MAIN.
002000     DISPLAY "ID     NAME                  PRICE     STOCK"
002100     OPEN INPUT PRODUCT-FILE
002200     PERFORM UNTIL WS-EOF = 'Y'
002300       READ PRODUCT-FILE
002400         AT END MOVE 'Y' TO WS-EOF
002500         NOT AT END
002600           DISPLAY F-PRD-ID ' ' F-PRD-NAME
002700             ' ' F-PRD-PRICE ' ' F-PRD-STOCK
002800       END-READ
002900     END-PERFORM
003000     CLOSE PRODUCT-FILE
003100     EXIT PROGRAM.
