000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID. ROLS6003.
000300 DATA DIVISION.
000400 WORKING-STORAGE SECTION.
000500 COPY CPM-ORDER.
000600 COPY CPM-PAR9001.
000700 PROCEDURE DIVISION.
000800 MAIN.
000900     ACCEPT ORD-ID
001000     ACCEPT ORD-QUANTITY
001100     MOVE ORD-ID TO VAL-ORDER-ID
001200     MOVE ORD-QUANTITY TO VAL-QUANTITY
001300     CALL "ROLS9001" USING VALIDATION-PARAMETERS
001400     IF VAL-RESULT = "Y"
001500        DISPLAY "OK MODIFICATION VALIDATED"
001600     ELSE
001700        DISPLAY VAL-MESSAGE
001800     END-IF
001900     EXIT PROGRAM.
