000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID. ROLS6021.
000300 ENVIRONMENT DIVISION.
000400 INPUT-OUTPUT SECTION.
000500 FILE-CONTROL.
000600     SELECT PRODUCT-FILE ASSIGN TO "data/products.dat"
000700       ORGANIZATION IS SEQUENTIAL.
000800 DATA DIVISION.
000900 FILE SECTION.
001000 FD PRODUCT-FILE.
001100 01 PRODUCT-FILE-REC.
001200    05 F-PRD-ID PIC 9(6).
001300    05 F-PRD-NAME PIC X(30).
001400    05 F-PRD-PRICE PIC 9(7)V99.
001500    05 F-PRD-STOCK PIC 9(7).
001600 WORKING-STORAGE SECTION.
001700 COPY CPM-PRODUCT.
001800 PROCEDURE DIVISION.
001900 MAIN.
002000     ACCEPT PRD-ID
002100     ACCEPT PRD-NAME
002200     ACCEPT PRD-PRICE
002300     ACCEPT PRD-STOCK
002400     MOVE PRD-ID TO F-PRD-ID
002500     MOVE PRD-NAME TO F-PRD-NAME
002600     MOVE PRD-PRICE TO F-PRD-PRICE
002700     MOVE PRD-STOCK TO F-PRD-STOCK
002800     OPEN EXTEND PRODUCT-FILE
002900     WRITE PRODUCT-FILE-REC
003000     CLOSE PRODUCT-FILE
003100     DISPLAY "OK PRODUCT STORED"
003200     EXIT PROGRAM.
