000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID. ROLS0001.
000300 DATA DIVISION.
000400 WORKING-STORAGE SECTION.
000500 01 WS-CHOICE PIC X.
000600 PROCEDURE DIVISION.
000700 MAIN.
000800     ACCEPT WS-CHOICE
000900     EVALUATE WS-CHOICE
001000       WHEN "1" CALL "ROLS6001"
001100       WHEN "2" CALL "ROLS6010"
001200       WHEN "3" CALL "ROLS6020"
001300       WHEN OTHER CONTINUE
001400     END-EVALUATE
001500     STOP RUN.
