000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID. ROLS9003.
000300 DATA DIVISION.
000400 LINKAGE SECTION.
000500 01 LK-ID PIC 9(6).
000600 PROCEDURE DIVISION USING LK-ID.
000700 MAIN.
000800 DISPLAY "COMMON LOOKUP/DB ROUTINE FOR ID " LK-ID
000900 EXIT PROGRAM.
