000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID. ROLS6013.
000300 ENVIRONMENT DIVISION.
000400 INPUT-OUTPUT SECTION.
000500 FILE-CONTROL.
000600     SELECT CUSTOMER-FILE ASSIGN TO "data/customers.dat"
000700       ORGANIZATION IS SEQUENTIAL.
000800 DATA DIVISION.
000900 FILE SECTION.
001000 FD CUSTOMER-FILE.
001100 01 CUSTOMER-FILE-REC.
001200    05 F-CUS-ID PIC 9(6).
001300    05 F-CUS-NAME PIC X(30).
001400    05 F-CUS-STATUS PIC X(10).
001500 WORKING-STORAGE SECTION.
001600 01 WS-EOF PIC X VALUE SPACE.
001700 PROCEDURE DIVISION.
001800 MAIN.
001900     DISPLAY "ID     NAME                           STATUS"
002000     OPEN INPUT CUSTOMER-FILE
002100     PERFORM UNTIL WS-EOF = 'Y'
002200       READ CUSTOMER-FILE
002300         AT END MOVE 'Y' TO WS-EOF
002400         NOT AT END
002500           DISPLAY F-CUS-ID ' ' F-CUS-NAME
002600             ' ' F-CUS-STATUS
002700       END-READ
002800     END-PERFORM
002900     CLOSE CUSTOMER-FILE
003000     EXIT PROGRAM.
