000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID. ROLS9002.
000300 DATA DIVISION.
000400 LINKAGE SECTION.
000500 01 LK-PRODUCT-ID PIC 9(6).
000600 01 LK-QUANTITY PIC 9(5).
000700 01 LK-AMOUNT PIC 9(7)V99.
000800 PROCEDURE DIVISION USING LK-PRODUCT-ID LK-QUANTITY LK-AMOUNT.
000900 MAIN.
001000 COMPUTE LK-AMOUNT = LK-QUANTITY * 10.00
001100 EXIT PROGRAM.
