000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID. ROLS6300.
000300 PROCEDURE DIVISION.
000400 MAIN.
000500 DISPLAY "BATCH: daily report"
000600 DISPLAY "See data/orders.dat and data/order_history.dat"
000700 STOP RUN.
