000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID. ROLS6022.
000300 DATA DIVISION.
000400 WORKING-STORAGE SECTION.
000500 COPY CPM-PRODUCT.
000600 PROCEDURE DIVISION.
000700 MAIN.
000800     ACCEPT PRD-ID
000900     CALL "ROLS9003" USING PRD-ID
001000     EXIT PROGRAM.
