000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID. ROLS6011.
000300 ENVIRONMENT DIVISION.
000400 INPUT-OUTPUT SECTION.
000500 FILE-CONTROL.
000600     SELECT CUSTOMER-FILE ASSIGN TO "data/customers.dat"
000700       ORGANIZATION IS SEQUENTIAL.
000800 DATA DIVISION.
000900 FILE SECTION.
001000 FD CUSTOMER-FILE.
001100 01 CUSTOMER-FILE-REC.
001200    05 F-CUS-ID PIC 9(6).
001300    05 F-CUS-NAME PIC X(30).
001400    05 F-CUS-STATUS PIC X(10).
001500 WORKING-STORAGE SECTION.
001600 COPY CPM-CUSTOMER.
001700 PROCEDURE DIVISION.
001800 MAIN.
001900     ACCEPT CUS-ID
002000     ACCEPT CUS-NAME
002100     MOVE 'ACTIVE' TO CUS-STATUS
002200     MOVE CUS-ID TO F-CUS-ID
002300     MOVE CUS-NAME TO F-CUS-NAME
002400     MOVE CUS-STATUS TO F-CUS-STATUS
002500     OPEN EXTEND CUSTOMER-FILE
002600     WRITE CUSTOMER-FILE-REC
002700     CLOSE CUSTOMER-FILE
002800     DISPLAY "OK CUSTOMER STORED"
002900     EXIT PROGRAM.
