000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID. ROLS6012.
000300 DATA DIVISION.
000400 WORKING-STORAGE SECTION.
000500 COPY CPM-CUSTOMER.
000600 PROCEDURE DIVISION.
000700 MAIN.
000800     ACCEPT CUS-ID
000900     CALL "ROLS9003" USING CUS-ID
001000     EXIT PROGRAM.
