000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID. ROLS6020.
000300 DATA DIVISION.
000400 WORKING-STORAGE SECTION.
000500 01 WS-CHOICE PIC X.
000600 PROCEDURE DIVISION.
000700 MAIN.
000800     ACCEPT WS-CHOICE
000900     IF WS-CHOICE = "1" CALL "ROLS6023" END-IF
001000     IF WS-CHOICE = "2" CALL "ROLS6022" END-IF
001100     IF WS-CHOICE = "3" CALL "ROLS6021" END-IF
001200     EXIT PROGRAM.
