000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID. ROLS6001.
000300 DATA DIVISION.
000400 WORKING-STORAGE SECTION.
000500 01 WS-CHOICE PIC X.
000600 PROCEDURE DIVISION.
000700 MAIN.
000800     ACCEPT WS-CHOICE
000900     EVALUATE WS-CHOICE
001000       WHEN "1" CALL "ROLS6005"
001100       WHEN "2" CALL "ROLS6002"
001200       WHEN "3" CALL "ROLS6003"
001300       WHEN "4" CALL "ROLS6004"
001400       WHEN OTHER CONTINUE
001500     END-EVALUATE
001600     EXIT PROGRAM.
