000100 01  PRODUCT-REC.
000200 05  PRD-ID              PIC 9(6).
000300 05  PRD-NAME            PIC X(30).
000400 05  PRD-PRICE           PIC 9(7)V99.
000500 05  PRD-STOCK           PIC 9(7).
